In [21]:
import pandas as pd

df = pd.DataFrame({"Name": ["John", "Rock", "Neil", "Tom", "John", "John"],
                   "Rank": [1, 2, 3, 6, 1, 1],
                   "Marks": [98, 59, 97, 99, 98, 98]})

In [22]:
df

   Name  Rank  Marks
0  John     1     98
1  Rock     2     59
2  Neil     3     97
3   Tom     6     99
4  John     1     98
5  John     1     98

In [5]:
# to get all the duplicates
df.duplicated(keep=False)

0     True
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [6]:
# to get the duplicated number
df.duplicated(keep=False).sum()

3

In [7]:
# shift+tab to get the menu try and you ll know
df.duplicated().sum()

2

In [8]:
df.loc[df.duplicated(keep=False)]

   Name  Rank  Marks
0  John     1     98
4  John     1     98
5  John     1     98

In [9]:
# remove all the duplicates
df.drop_duplicates(keep=False)

   Name  Rank  Marks
1  Rock     2     59
2  Neil     3     97
3   Tom     6     99

In [10]:
# drop duplicates except the last occurrence
df.drop_duplicates(keep='last')

   Name  Rank  Marks
1  Rock     2     59
2  Neil     3     97
3   Tom     6     99
5  John     1     98

In [12]:
df.drop_duplicates(keep="first")

   Name  Rank  Marks
0  John     1     98
1  Rock     2     59
2  Neil     3     97
3   Tom     6     99

In [17]:

# inplace=True will change the dataframe
df.drop_duplicates(keep="first", inplace=True)

In [ ]:
#  df.duplicated(keep=False).sum() counts all duplicates including the first occurrences, giving the total count of rows that appear more than once.
# df.duplicated().sum() counts duplicates while keeping the first occurrence of each set of duplicates, providing a count of the rows that are considered duplicates beyond their first appearance.